=begin
доказательство от противного
https://www.youtube.com/watch?v=V7lK7ChVJfo

https://ru.wikipedia.org/wiki/%D0%94%D0%BE%D0%BA%D0%B0%D0%B7%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D1%82%D0%B2%D0%BE_%D0%BE%D1%82_%D0%BF%D1%80%D0%BE%D1%82%D0%B8%D0%B2%D0%BD%D0%BE%D0%B3%D0%BE
Доказательство «от противного» (лат. contradictio in contrarium) в математике — вид доказательства, при котором «доказывание» некоторого суждения (тезиса доказательства) осуществляется через опровержение отрицания этого суждения — антитезиса. Этот способ доказательства основывается на истинности закона двойного отрицания в классической логике.

Схема доказательства
Доказательство утверждения {\displaystyle A} A проводится следующим образом. Сначала принимают предположение, что утверждение {\displaystyle A} A неверно, а затем доказывают, что при таком предположении было бы верно некоторое утверждение {\displaystyle B} B, которое заведомо неверно.

Из определения импликации следует, что, если {\displaystyle B} B ложно, то формула {\displaystyle \neg A\Rightarrow B} {\displaystyle \neg A\Rightarrow B} истинна тогда и только тогда, когда {\displaystyle \neg A} \neg A ложно, следовательно утверждение {\displaystyle A} A истинно.

Полученное противоречие показывает, что исходное предположение было неверным, и поэтому верно утверждение {\displaystyle \neg \neg A} \neg \neg A, которое по закону двойного отрицания равносильно утверждению {\displaystyle A} A.

В интуиционистской логике закон исключённого третьего не действует, поэтому такие доказательства в ней не принимаются.

Пример
Доказательство иррациональности числа {\displaystyle {\sqrt {2}}} {\sqrt {2}}.
Допустим противное: число {\displaystyle {\sqrt {2}}} {\sqrt {2}} рационально, то есть представляется в виде несократимой дроби {\displaystyle {\frac {m}{n}}} {\frac {m}{n}}, где {\displaystyle m} m — целое число, а {\displaystyle n} n — натуральное. Возведём предполагаемое равенство в квадрат:

{\displaystyle {\sqrt {2}}={\frac {m}{n}}} {\sqrt  {2}}={\frac  {m}{n}} {\displaystyle \Rightarrow } \Rightarrow {\displaystyle 2={\frac {m^{2}}{n^{2}}}} 2={\frac  {m^{2}}{n^{2}}}, откуда {\displaystyle m^{2}=2n^{2}} m^{2}=2n^{2}.
Отсюда следует, что {\displaystyle m^{2}} m^{2} чётно, значит, чётно и {\displaystyle m} m; следовательно, {\displaystyle m^{2}} m^{2} делится на 4, а значит, {\displaystyle n^{2}} n^{2} и {\displaystyle n} n тоже чётны. Полученное утверждение противоречит несократимости дроби {\displaystyle {\frac {m}{n}}} {\frac {m}{n}}. Значит, исходное предположение было неверным, и {\displaystyle {\sqrt {2}}} {\sqrt {2}} — иррациональное число.

Другие примеры
Врач, убеждая пациента в том, что тот не болен гриппом, может рассуждать следующим образом: «Если бы вы действительно были больны гриппом, то у вас была бы повышена температура, был заложен нос и т. д. Но ничего этого нет. Следовательно, нет и гриппа».

=end
